Revit 2026 API

# FailuresAccessorPostFailure Method

---

Posts an additional failure message to be processed for the current transaction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void PostFailure(
	FailureMessage failure
)
```
```vb
Public Sub PostFailure (
	failure As FailureMessage
)
```
```cpp
public:
void PostFailure(
	FailureMessage^ failure
)
```
```fsharp
member PostFailure :
        failure : FailureMessage -> unit
```

#### Parameters

failure FailureMessage
     Failure message to post.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

Should be used during failures processing instead of a similar method in a document class. Using method of the document class with the same name during failures processing is prohibited.

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace